# Pandas assigment

### Import the necessary libraries

### Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv).

### See the first 10 entries

### See a random 10 lines

### What is the number of observations in the dataset?

### What is the number of columns in the dataset?

### Print the name of all the columns.

### How is the dataset indexed?

### How is the dataset **semantically** indexed?

### Which was the most-ordered item?

### For the most-ordered item, how many items were ordered?

### How many items were orderd in total?

### Turn the item price into a float

#### a. Check the item price type

#### b. Create a lambda function and change the type of item price

### What was the total revenue for the period in the dataset?

### How many orders were made in the period?

### What is the average revenue  per order?

### What is the median revenue per order?

### Describe the revenue per order statistics (Minimium, maximum, mean, median %25 percentile, %75 percentile etc.)

## Filtering and Sorting Data

### What is the price of each item?

### Is there more then one price per item? If so, why?

### What is the average price per item?

### How many products cost, in average, more than $10.00?

### Sort by the name of the item

### What were the quantities in the most expensive order?

### How many times was a Veggie Salad Bowl ordered?

### How many times did someone order more than one Canned Soda?

## Merges and joins

Use the display function defined belowe to print the results of the tables you are joining, side by side

In [64]:
class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

In [65]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue','David'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR','Managment']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
display('df1','df2')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
4    David    Managment

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

### Create one table with all employee names and data

In [56]:
# Hint: df1.merge?

In [60]:
# Are all the employees really available?

## Add the superviser name to the table of all data

In [61]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})

In [66]:
display('df1','df2','df4')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
4    David    Managment

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

df4
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

## Add skills

In [67]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})
display('df1','df2','df4','df5')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
4    David    Managment

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

df4
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

df5
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

### Add skills such that employee names can be duplicated

Results should look like:

In [73]:
# What's the code?

  employee        group  hire_date supervisor        skills
0      Bob   Accounting       2008      Carly          math
1      Bob   Accounting       2008      Carly  spreadsheets
2     Jake  Engineering       2012      Guido        coding
3     Jake  Engineering       2012      Guido         linux
4     Lisa  Engineering       2004      Guido        coding
5     Lisa  Engineering       2004      Guido         linux
6      Sue           HR       2014      Steve  spreadsheets
7      Sue           HR       2014      Steve  organization

### Add skills but keep one row per employee

Results should look like:

In [80]:
# What's the code? 
# Hint: this is more difficult and non standrad. Start by merging all dataframes excluding df5 into a new dataframe, let's call it df6
# use map() on the proper column of df6 and map the result of a proper groupby() and apply() operation on df5

  employee        group  hire_date supervisor                         skils
0      Bob   Accounting       2008      Carly          [math, spreadsheets]
1     Jake  Engineering       2012      Guido               [coding, linux]
2     Lisa  Engineering       2004      Guido               [coding, linux]
3      Sue           HR       2014      Steve  [spreadsheets, organization]

## Merging with "set aritmethic"

The following picture captures the potential way to combined two sets (AKA set aritmethics)

In [84]:
from IPython.display import Image
from IPython.core.display import HTML 
Image(url= "https://www.metabase.com/learn/images/sql-join-types/join-types.png")

In [83]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])
display('df6', 'df7')

df6
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

df7
     name drink
0    Mary  wine
1  Joseph  beer

### Do an inner join

In [88]:
# Hint: df6.merge? - focuse on the "how" property

### Do an left join, df6 on the left

In [88]:
# Hint: df6.merge? - focuse on the "how" property

### Do an right join, df7 on the right

In [88]:
# Hint: df6.merge? - focuse on the "how" property

### Do an outer join

In [88]:
# Hint: df6.merge? - focuse on the "how" property